import React from 'react'

const CartPage = () => {
  return (
    <>
      <section className='pt-[50px] sm:pt-[180px] pb-[60px] sm:pb-[73px]'>
        <div className="container mx-auto px-[0px]  sm:px-[20px] md:px-[20px] lg:px-[100px] pt-[40px]">
          <h1 className='pb-[10px] sm:pb-[20px] pl-[25px] sm:pl-[0px] text-[20px] sm:text-[24px] font-bold'>Корзина</h1>
          <div className='grid grid-cols-1 xl:flex items-start justify-between gap-[20px] overscroll-y-auto'>
            <div className='max-w-[901px]w-full border-[#E3E3E8]  bg-[white] border-[1px] px-[20px] py-[20px] rounded-[6px]'>
              <div className='flex items-center gap-[15px] justify-between pb-[15px]'>
                <div className='flex gap-[10px]'>
                  <input className='border-[#E3E3E8] w-[15px] sm:w-[20px] h-[15px] sm:h-[20px]' type="checkbox" />
                  <p className='text-[12px] sm:text-[16px] whitespace-nowrap'>Отметить/снять все товары</p>
                </div>
                <button className='flex cursor-pointer gap-[5px] sm:gap-[10px] text-[red]'>
                  <p className='text-[12px] sm:text-[16px] whitespace-nowrap'>Удалить отмеченные</p>
                  <svg className='' width="20" height="20" viewBox="0 0 20 20" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path d="M5.74857 5.41668C5.74857 5.00247 5.41278 4.66668 4.99857 4.66668C4.58436 4.66668 4.24857 5.00247 4.24857 5.41668H5.74857ZM15.7527 5.00002C15.7527 4.5858 15.4169 4.25002 15.0027 4.25002C14.5885 4.25002 14.2527 4.5858 14.2527 5.00002H15.7527ZM12.418 8.33265C12.418 7.91844 12.0822 7.58265 11.668 7.58265C11.2538 7.58265 10.918 7.91844 10.918 8.33265H12.418ZM10.918 14.1684C10.918 14.5826 11.2538 14.9184 11.668 14.9184C12.0822 14.9184 12.418 14.5826 12.418 14.1684H10.918ZM9.08329 8.33265C9.08329 7.91844 8.7475 7.58265 8.33329 7.58265C7.91908 7.58265 7.58329 7.91844 7.58329 8.33265H9.08329ZM7.58329 14.1684C7.58329 14.5826 7.91908 14.9184 8.33329 14.9184C8.7475 14.9184 9.08329 14.5826 9.08329 14.1684H7.58329ZM3.74805 4.24793C3.33383 4.24793 2.99805 4.58372 2.99805 4.99793C2.99805 5.41215 3.33383 5.74793 3.74805 5.74793V4.24793ZM16.2533 5.74793C16.6675 5.74793 17.0033 5.41215 17.0033 4.99793C17.0033 4.58372 16.6675 4.24793 16.2533 4.24793V5.74793ZM5.95442 4.76076C5.82343 5.15372 6.0358 5.57846 6.42876 5.70944C6.82171 5.84043 7.24645 5.62806 7.37744 5.2351L5.95442 4.76076ZM7.11945 3.63736L7.83096 3.87454L7.83102 3.87436L7.11945 3.63736ZM8.70178 2.49689L8.7016 3.24689H8.70178V2.49689ZM11.2995 2.49689V3.24689L11.3005 3.24689L11.2995 2.49689ZM12.8835 3.63736L13.5953 3.40098L13.5951 3.40037L12.8835 3.63736ZM12.6236 5.23432C12.7541 5.62742 13.1787 5.84026 13.5718 5.7097C13.9649 5.57915 14.1777 5.15465 14.0471 4.76154L12.6236 5.23432ZM4.24857 5.41668V15.8358H5.74857V5.41668H4.24857ZM4.24857 15.8358C4.24857 17.1708 5.33086 18.2531 6.66593 18.2531V16.7531C6.15929 16.7531 5.74857 16.3424 5.74857 15.8358H4.24857ZM6.66593 18.2531H13.3354V16.7531H6.66593V18.2531ZM13.3354 18.2531C14.6704 18.2531 15.7527 17.1708 15.7527 15.8358H14.2527C14.2527 16.3424 13.842 16.7531 13.3354 16.7531V18.2531ZM15.7527 15.8358V5.00002H14.2527V15.8358H15.7527ZM10.918 8.33265V14.1684H12.418V8.33265H10.918ZM7.58329 8.33265V14.1684H9.08329V8.33265H7.58329ZM3.74805 5.74793H16.2533V4.24793H3.74805V5.74793ZM7.37744 5.2351L7.83096 3.87454L6.40794 3.40019L5.95442 4.76076L7.37744 5.2351ZM7.83102 3.87436C7.95585 3.49958 8.30657 3.24679 8.7016 3.24689L8.70195 1.74689C7.66102 1.74664 6.73682 2.41277 6.40788 3.40036L7.83102 3.87436ZM8.70178 3.24689H11.2995V1.74689H8.70178V3.24689ZM11.3005 3.24689C11.6958 3.2464 12.047 3.49926 12.1719 3.87436L13.5951 3.40037C13.2659 2.41192 12.3404 1.7456 11.2986 1.74689L11.3005 3.24689ZM12.1717 3.87375L12.6236 5.23432L14.0471 4.76154L13.5953 3.40098L12.1717 3.87375Z" fill="#F11A22" />
                  </svg>
                </button>
              </div>
              <hr className='text-[#E3E3E8]' />
              <div className='py-[10px] sm:py-[20px] grid grid-cols-1 sm:flex items-center justify-between gap-[20px] md:gap-[30px] xl:gap-[60px]'>
                <div className='flex items-center gap-[15px] xl:gap-[20px]'>
                  <input className='w-[20px] h-[20px]' type="checkbox" name="" id="" />
                  <img src="/cart-1.png" alt="img" />
                  <div className='flex flex-col gap-[5px]'>
                    <p>Genesis</p>
                    <p className='w-full line-clamp-2 xl:line-clamp-0'>Масло Genesis SUPER 3000 X1 5W-40, 1 л. </p>
                    <p className='text-[#55556D] whitespace-nowrap'>Артикул: 0092S40240</p>
                  </div>
                </div>
                <div className='flex mt-[-30px] items-center gap-[20px] md:gap-[30px] xl:gap-[55px]'>
                  <p className='whitespace-nowrap'>5 дней</p>
                  <div className='flex flex-col items-center gap-[5px] mt-[30px]'>
                    <div className='bg-[#F1F2F4] rounded-[58px] flex px-[5px] items-center justify-between w-[120px] h-[40px]'>
                      <button className='bg-[white] inline-block pl-[5px] cursor-pointer w-[30px] h-[30px] rounded-[24px]'>
                        <img src="/Plus, Add.png" alt="" />
                      </button>
                      <div className='flex items-center gap-[10px]'>
                        1
                      </div>
                      <button className='bg-[white] inline-block pl-[5px] cursor-pointer w-[30px] h-[30px] rounded-[24px]'>
                        <img src="/Plus.png" alt="" />
                      </button>
                    </div>
                    <p className='text-[#7A7680] text-[12px]'>1 шт = 2 060 ₽  </p>
                  </div>
                  <p className='font-bold text-[18px] md:text-[18px] whitespace-nowrap'>2 060 ₽</p>
                  <svg width="20" height="20" viewBox="0 0 20 20" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path d="M5.74857 5.41668C5.74857 5.00247 5.41278 4.66668 4.99857 4.66668C4.58436 4.66668 4.24857 5.00247 4.24857 5.41668H5.74857ZM15.7527 5.00002C15.7527 4.5858 15.4169 4.25002 15.0027 4.25002C14.5885 4.25002 14.2527 4.5858 14.2527 5.00002H15.7527ZM12.418 8.33265C12.418 7.91844 12.0822 7.58265 11.668 7.58265C11.2538 7.58265 10.918 7.91844 10.918 8.33265H12.418ZM10.918 14.1684C10.918 14.5826 11.2538 14.9184 11.668 14.9184C12.0822 14.9184 12.418 14.5826 12.418 14.1684H10.918ZM9.08329 8.33265C9.08329 7.91844 8.7475 7.58265 8.33329 7.58265C7.91908 7.58265 7.58329 7.91844 7.58329 8.33265H9.08329ZM7.58329 14.1684C7.58329 14.5826 7.91908 14.9184 8.33329 14.9184C8.7475 14.9184 9.08329 14.5826 9.08329 14.1684H7.58329ZM3.74805 4.24793C3.33383 4.24793 2.99805 4.58372 2.99805 4.99793C2.99805 5.41215 3.33383 5.74793 3.74805 5.74793V4.24793ZM16.2533 5.74793C16.6675 5.74793 17.0033 5.41215 17.0033 4.99793C17.0033 4.58372 16.6675 4.24793 16.2533 4.24793V5.74793ZM5.95442 4.76076C5.82343 5.15372 6.0358 5.57846 6.42876 5.70944C6.82171 5.84043 7.24645 5.62806 7.37744 5.2351L5.95442 4.76076ZM7.11945 3.63736L7.83096 3.87454L7.83102 3.87436L7.11945 3.63736ZM8.70178 2.49689L8.7016 3.24689H8.70178V2.49689ZM11.2995 2.49689V3.24689L11.3005 3.24689L11.2995 2.49689ZM12.8835 3.63736L13.5953 3.40098L13.5951 3.40037L12.8835 3.63736ZM12.6236 5.23432C12.7541 5.62742 13.1787 5.84026 13.5718 5.7097C13.9649 5.57915 14.1777 5.15465 14.0471 4.76154L12.6236 5.23432ZM4.24857 5.41668V15.8358H5.74857V5.41668H4.24857ZM4.24857 15.8358C4.24857 17.1708 5.33086 18.2531 6.66593 18.2531V16.7531C6.15929 16.7531 5.74857 16.3424 5.74857 15.8358H4.24857ZM6.66593 18.2531H13.3354V16.7531H6.66593V18.2531ZM13.3354 18.2531C14.6704 18.2531 15.7527 17.1708 15.7527 15.8358H14.2527C14.2527 16.3424 13.842 16.7531 13.3354 16.7531V18.2531ZM15.7527 15.8358V5.00002H14.2527V15.8358H15.7527ZM10.918 8.33265V14.1684H12.418V8.33265H10.918ZM7.58329 8.33265V14.1684H9.08329V8.33265H7.58329ZM3.74805 5.74793H16.2533V4.24793H3.74805V5.74793ZM7.37744 5.2351L7.83096 3.87454L6.40794 3.40019L5.95442 4.76076L7.37744 5.2351ZM7.83102 3.87436C7.95585 3.49958 8.30657 3.24679 8.7016 3.24689L8.70195 1.74689C7.66102 1.74664 6.73682 2.41277 6.40788 3.40036L7.83102 3.87436ZM8.70178 3.24689H11.2995V1.74689H8.70178V3.24689ZM11.3005 3.24689C11.6958 3.2464 12.047 3.49926 12.1719 3.87436L13.5951 3.40037C13.2659 2.41192 12.3404 1.7456 11.2986 1.74689L11.3005 3.24689ZM12.1717 3.87375L12.6236 5.23432L14.0471 4.76154L13.5953 3.40098L12.1717 3.87375Z" fill="#92979E " />
                  </svg>
                </div>

              </div>
              <hr className='text-[#E3E3E8]' />
              <div className='py-[10px] sm:py-[20px] grid grid-cols-1 sm:flex items-center justify-between gap-[20px] md:gap-[30px] xl:gap-[60px]'>
                <div className='flex items-center gap-[15px] xl:gap-[20px]'>
                  <input className='w-[20px] h-[20px]' type="checkbox" name="" id="" />
                  <img src="/cart-1.png" alt="img" />
                  <div className='flex flex-col gap-[5px]'>
                    <p>Genesis</p>
                    <p className='w-full line-clamp-2 xl:line-clamp-0'>Масло Genesis SUPER 3000 X1 5W-40, 1 л. </p>
                    <p className='text-[#55556D] whitespace-nowrap'>Артикул: 0092S40240</p>
                  </div>
                </div>
                <div className='flex mt-[-30px] items-center gap-[20px] md:gap-[30px] xl:gap-[55px]'>
                  <p className='whitespace-nowrap'>5 дней</p>
                  <div className='flex flex-col items-center gap-[5px] mt-[30px]'>
                    <div className='bg-[#F1F2F4] rounded-[58px] flex px-[5px] items-center justify-between w-[120px] h-[40px]'>
                      <button className='bg-[white] inline-block pl-[5px] cursor-pointer w-[30px] h-[30px] rounded-[24px]'>
                        <img src="/Plus, Add.png" alt="" />
                      </button>
                      <div>
                        1
                      </div>
                      <button className='bg-[white] inline-block pl-[5px] cursor-pointer w-[30px] h-[30px] rounded-[24px]'>
                        <img src="/Plus.png" alt="" />
                      </button>
                    </div>
                    <p className='text-[#7A7680] text-[12px]'>1 шт = 2 060 ₽  </p>
                  </div>
                  <p className='font-bold text-[18px] md:text-[18px] whitespace-nowrap'>2 060 ₽</p>
                  <svg width="20" height="20" viewBox="0 0 20 20" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path d="M5.74857 5.41668C5.74857 5.00247 5.41278 4.66668 4.99857 4.66668C4.58436 4.66668 4.24857 5.00247 4.24857 5.41668H5.74857ZM15.7527 5.00002C15.7527 4.5858 15.4169 4.25002 15.0027 4.25002C14.5885 4.25002 14.2527 4.5858 14.2527 5.00002H15.7527ZM12.418 8.33265C12.418 7.91844 12.0822 7.58265 11.668 7.58265C11.2538 7.58265 10.918 7.91844 10.918 8.33265H12.418ZM10.918 14.1684C10.918 14.5826 11.2538 14.9184 11.668 14.9184C12.0822 14.9184 12.418 14.5826 12.418 14.1684H10.918ZM9.08329 8.33265C9.08329 7.91844 8.7475 7.58265 8.33329 7.58265C7.91908 7.58265 7.58329 7.91844 7.58329 8.33265H9.08329ZM7.58329 14.1684C7.58329 14.5826 7.91908 14.9184 8.33329 14.9184C8.7475 14.9184 9.08329 14.5826 9.08329 14.1684H7.58329ZM3.74805 4.24793C3.33383 4.24793 2.99805 4.58372 2.99805 4.99793C2.99805 5.41215 3.33383 5.74793 3.74805 5.74793V4.24793ZM16.2533 5.74793C16.6675 5.74793 17.0033 5.41215 17.0033 4.99793C17.0033 4.58372 16.6675 4.24793 16.2533 4.24793V5.74793ZM5.95442 4.76076C5.82343 5.15372 6.0358 5.57846 6.42876 5.70944C6.82171 5.84043 7.24645 5.62806 7.37744 5.2351L5.95442 4.76076ZM7.11945 3.63736L7.83096 3.87454L7.83102 3.87436L7.11945 3.63736ZM8.70178 2.49689L8.7016 3.24689H8.70178V2.49689ZM11.2995 2.49689V3.24689L11.3005 3.24689L11.2995 2.49689ZM12.8835 3.63736L13.5953 3.40098L13.5951 3.40037L12.8835 3.63736ZM12.6236 5.23432C12.7541 5.62742 13.1787 5.84026 13.5718 5.7097C13.9649 5.57915 14.1777 5.15465 14.0471 4.76154L12.6236 5.23432ZM4.24857 5.41668V15.8358H5.74857V5.41668H4.24857ZM4.24857 15.8358C4.24857 17.1708 5.33086 18.2531 6.66593 18.2531V16.7531C6.15929 16.7531 5.74857 16.3424 5.74857 15.8358H4.24857ZM6.66593 18.2531H13.3354V16.7531H6.66593V18.2531ZM13.3354 18.2531C14.6704 18.2531 15.7527 17.1708 15.7527 15.8358H14.2527C14.2527 16.3424 13.842 16.7531 13.3354 16.7531V18.2531ZM15.7527 15.8358V5.00002H14.2527V15.8358H15.7527ZM10.918 8.33265V14.1684H12.418V8.33265H10.918ZM7.58329 8.33265V14.1684H9.08329V8.33265H7.58329ZM3.74805 5.74793H16.2533V4.24793H3.74805V5.74793ZM7.37744 5.2351L7.83096 3.87454L6.40794 3.40019L5.95442 4.76076L7.37744 5.2351ZM7.83102 3.87436C7.95585 3.49958 8.30657 3.24679 8.7016 3.24689L8.70195 1.74689C7.66102 1.74664 6.73682 2.41277 6.40788 3.40036L7.83102 3.87436ZM8.70178 3.24689H11.2995V1.74689H8.70178V3.24689ZM11.3005 3.24689C11.6958 3.2464 12.047 3.49926 12.1719 3.87436L13.5951 3.40037C13.2659 2.41192 12.3404 1.7456 11.2986 1.74689L11.3005 3.24689ZM12.1717 3.87375L12.6236 5.23432L14.0471 4.76154L13.5953 3.40098L12.1717 3.87375Z" fill="#92979E " />
                  </svg>
                </div>

              </div>
              <hr className='text-[#E3E3E8]' />
              <div className='py-[10px] sm:py-[20px] grid grid-cols-1 sm:flex items-center justify-between gap-[20px] md:gap-[30px] xl:gap-[60px]'>
                <div className='flex items-center gap-[15px] xl:gap-[20px]'>
                  <input className='w-[20px] h-[20px]' type="checkbox" name="" id="" />
                  <img src="/cart-1.png" alt="img" />
                  <div className='flex flex-col gap-[5px]'>
                    <p>Genesis</p>
                    <p className='w-full line-clamp-2 xl:line-clamp-0'>Масло Genesis SUPER 3000 X1 5W-40, 1 л. </p>
                    <p className='text-[#55556D] whitespace-nowrap'>Артикул: 0092S40240</p>
                  </div>
                </div>
                <div className='flex mt-[-30px] items-center gap-[20px] md:gap-[30px] xl:gap-[55px]'>
                  <p className='whitespace-nowrap'>5 дней</p>
                  <div className='flex flex-col items-center gap-[5px] mt-[30px]'>
                    <div className='bg-[#F1F2F4] rounded-[58px] flex px-[5px] items-center justify-between w-[120px] h-[40px]'>
                      <button className='bg-[white] inline-block pl-[5px] cursor-pointer w-[30px] h-[30px] rounded-[24px]'>
                        <img src="/Plus, Add.png" alt="" />
                      </button>
                      <div>
                        1
                      </div>
                      <button className='bg-[white] inline-block pl-[5px] cursor-pointer w-[30px] h-[30px] rounded-[24px]'>
                        <img src="/Plus.png" alt="" />
                      </button>
                    </div>
                    <p className='text-[#7A7680] text-[12px]'>1 шт = 2 060 ₽  </p>
                  </div>
                  <p className='font-bold text-[18px] md:text-[18px] whitespace-nowrap'>2 060 ₽</p>
                  <svg width="20" height="20" viewBox="0 0 20 20" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path d="M5.74857 5.41668C5.74857 5.00247 5.41278 4.66668 4.99857 4.66668C4.58436 4.66668 4.24857 5.00247 4.24857 5.41668H5.74857ZM15.7527 5.00002C15.7527 4.5858 15.4169 4.25002 15.0027 4.25002C14.5885 4.25002 14.2527 4.5858 14.2527 5.00002H15.7527ZM12.418 8.33265C12.418 7.91844 12.0822 7.58265 11.668 7.58265C11.2538 7.58265 10.918 7.91844 10.918 8.33265H12.418ZM10.918 14.1684C10.918 14.5826 11.2538 14.9184 11.668 14.9184C12.0822 14.9184 12.418 14.5826 12.418 14.1684H10.918ZM9.08329 8.33265C9.08329 7.91844 8.7475 7.58265 8.33329 7.58265C7.91908 7.58265 7.58329 7.91844 7.58329 8.33265H9.08329ZM7.58329 14.1684C7.58329 14.5826 7.91908 14.9184 8.33329 14.9184C8.7475 14.9184 9.08329 14.5826 9.08329 14.1684H7.58329ZM3.74805 4.24793C3.33383 4.24793 2.99805 4.58372 2.99805 4.99793C2.99805 5.41215 3.33383 5.74793 3.74805 5.74793V4.24793ZM16.2533 5.74793C16.6675 5.74793 17.0033 5.41215 17.0033 4.99793C17.0033 4.58372 16.6675 4.24793 16.2533 4.24793V5.74793ZM5.95442 4.76076C5.82343 5.15372 6.0358 5.57846 6.42876 5.70944C6.82171 5.84043 7.24645 5.62806 7.37744 5.2351L5.95442 4.76076ZM7.11945 3.63736L7.83096 3.87454L7.83102 3.87436L7.11945 3.63736ZM8.70178 2.49689L8.7016 3.24689H8.70178V2.49689ZM11.2995 2.49689V3.24689L11.3005 3.24689L11.2995 2.49689ZM12.8835 3.63736L13.5953 3.40098L13.5951 3.40037L12.8835 3.63736ZM12.6236 5.23432C12.7541 5.62742 13.1787 5.84026 13.5718 5.7097C13.9649 5.57915 14.1777 5.15465 14.0471 4.76154L12.6236 5.23432ZM4.24857 5.41668V15.8358H5.74857V5.41668H4.24857ZM4.24857 15.8358C4.24857 17.1708 5.33086 18.2531 6.66593 18.2531V16.7531C6.15929 16.7531 5.74857 16.3424 5.74857 15.8358H4.24857ZM6.66593 18.2531H13.3354V16.7531H6.66593V18.2531ZM13.3354 18.2531C14.6704 18.2531 15.7527 17.1708 15.7527 15.8358H14.2527C14.2527 16.3424 13.842 16.7531 13.3354 16.7531V18.2531ZM15.7527 15.8358V5.00002H14.2527V15.8358H15.7527ZM10.918 8.33265V14.1684H12.418V8.33265H10.918ZM7.58329 8.33265V14.1684H9.08329V8.33265H7.58329ZM3.74805 5.74793H16.2533V4.24793H3.74805V5.74793ZM7.37744 5.2351L7.83096 3.87454L6.40794 3.40019L5.95442 4.76076L7.37744 5.2351ZM7.83102 3.87436C7.95585 3.49958 8.30657 3.24679 8.7016 3.24689L8.70195 1.74689C7.66102 1.74664 6.73682 2.41277 6.40788 3.40036L7.83102 3.87436ZM8.70178 3.24689H11.2995V1.74689H8.70178V3.24689ZM11.3005 3.24689C11.6958 3.2464 12.047 3.49926 12.1719 3.87436L13.5951 3.40037C13.2659 2.41192 12.3404 1.7456 11.2986 1.74689L11.3005 3.24689ZM12.1717 3.87375L12.6236 5.23432L14.0471 4.76154L13.5953 3.40098L12.1717 3.87375Z" fill="#92979E " />
                  </svg>
                </div>

              </div>
            </div>
            <div className='w-full xl:max-w-[380px] bg-[white] h-[auto] w-full rounded-[6px]'>
              <div>
                <h1 className='py-[20px] text-[19px] sm:text-[24px] font-bold pl-[30px]'>Ваш заказ</h1>
              </div>
              <hr className='text-[#E3E3E8]' />
              <div className='flex items-center justify-between px-[30px] py-[20px]'>
                <p className='text-[16px] sm:text-[20px]'>Товары</p>
                <p className='text-[16px] sm:text-[20px]'>6</p>
              </div>
              <div className='px-[30px] pb-[20px]'>
                <input className='w-full py-[13px] px-[20px] text-[18px] rounded-[6px] text-[#55556D] outline-none  border-[1px] border-[#DEDEE2] h-[48px]' placeholder='Промокод' type="text" />
              </div>
              <hr className='text-[#E3E3E8]' />
              <div className=' py-[20px] px-[30px]'>
                <div className='flex items-center justify-between'>
                  <p className='text-[16px] sm:text-[20px]'>Итого</p>
                  <p className='text-[16px] sm:text-[20px]'>23 870 ₽</p>
                </div>
                <a href="cart-2">
                  <button className='bg-[#6B59CC] cursor-pointer w-full py-[16px] text-[14px] sm:text-[18px] rounded-[6px] mt-[16px] text-[white]'>
                    Оформление заказа
                  </button>
                </a>
                <p className='w-full text-[14px] sm:text-[16px] pt-[15px] text-[#7A7680] leading-[25px] text-center xl:text-left'>Цена зависит от типа клиента. После регистрации возможна ее корректировка.</p>
              </div>
            </div>
          </div>
        </div>
      </section>

    </>
  )
}

export default CartPage